dudasdavid/OmniWheelRobot17/STM32F3_mock/OmniWheelRobot/Src/main.c
/**
  ******************************************************************************
  * File Name          : main.c
  * Description        : Main program body
  ******************************************************************************
  *
  * Copyright (c) 2017 STMicroelectronics International N.V. 
  * All rights reserved.
  *
  * Redistribution and use in source and binary forms, with or without 
  * modification, are permitted, provided that the following conditions are met:
  *
  * 1. Redistribution of source code must retain the above copyright notice, 
  *    this list of conditions and the following disclaimer.
  * 2. Redistributions in binary form must reproduce the above copyright notice,
  *    this list of conditions and the following disclaimer in the documentation
  *    and/or other materials provided with the distribution.
  * 3. Neither the name of STMicroelectronics nor the names of other 
  *    contributors to this software may be used to endorse or promote products 
  *    derived from this software without specific written permission.
  * 4. This software, including modifications and/or derivative works of this 
  *    software, must execute solely and exclusively on microcontroller or
  *    microprocessor devices manufactured by or for STMicroelectronics.
  * 5. Redistribution and use of this software other than as permitted under 
  *    this license is void and will automatically terminate your rights under 
  *    this license. 
  *
  * THIS SOFTWARE IS PROVIDED BY STMICROELECTRONICS AND CONTRIBUTORS "AS IS" 
  * AND ANY EXPRESS, IMPLIED OR STATUTORY WARRANTIES, INCLUDING, BUT NOT 
  * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A 
  * PARTICULAR PURPOSE AND NON-INFRINGEMENT OF THIRD PARTY INTELLECTUAL PROPERTY
  * RIGHTS ARE DISCLAIMED TO THE FULLEST EXTENT PERMITTED BY LAW. IN NO EVENT 
  * SHALL STMICROELECTRONICS OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
  * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
  * LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, 
  * OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF 
  * LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING 
  * NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
  * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "stm32f3xx_hal.h"
#include "cmsis_os.h"

/* USER CODE BEGIN Includes */
#include <math.h>
#include <stdlib.h>
#include <tgmath.h>
#include "filter.h"
/* USER CODE END Includes */

/* Private variables ---------------------------------------------------------*/
ADC_HandleTypeDef hadc1;

I2C_HandleTypeDef hi2c1;

SPI_HandleTypeDef hspi1;

TIM_HandleTypeDef htim1;
TIM_HandleTypeDef htim2;
TIM_HandleTypeDef htim3;
TIM_HandleTypeDef htim4;
TIM_HandleTypeDef htim8;
TIM_HandleTypeDef htim15;

IRDA_HandleTypeDef hirda4;
UART_HandleTypeDef huart1;

osThreadId defaultTaskHandle;
osThreadId sensorTaskHandle;
osThreadId controlTaskHandle;

/* USER CODE BEGIN PV */
/* Private variables ---------------------------------------------------------*/
//static const uint16_t inputAxis[10]     = {0,  1, 5, 10, 20, 30, 50, 70, 85, 100};
//static const float outCurve[10] = {0, 0.1, 0.25, 0.35, 0.5, 0.55, 0.65, 0.9, 1.3, 2.0};  // komfort


static volatile float radius = 0.1;
static volatile float kaka = 0.0;

static volatile int16_t rawWheel1 = 0;
static volatile int16_t rawWheel2 = 0;
static volatile int16_t rawWheel3 = 0;

static float toMeterFactor = 0.00294;
static float posWheel1 = 0.0;
static float posWheel2 = 0.0;
static float posWheel3 = 0.0;
static float posWheel1_prev = 0.0;
static float posWheel2_prev = 0.0;
static float posWheel3_prev = 0.0;
static volatile float spdWheel1 = 0.0;
static volatile float spdWheel2 = 0.0;
static volatile float spdWheel3 = 0.0;
static volatile float spdWheel1_prev = 0.0;
static volatile float spdWheel2_prev = 0.0;
static volatile float spdWheel3_prev = 0.0;
static float spdWheel1Filtered = 0.0;
static float spdWheel2Filtered = 0.0;
static float spdWheel3Filtered = 0.0;
//static float spdWheel1Norm = 0.0;
static float spdWheel2Norm = 0.0;
static float spdWheel3Norm = 0.0;


static uint8_t receiveBuffer[3]={0};
static volatile float referenceSpeed = 0;
static volatile float referenceAngle = 0;
static volatile float referenceTurn = 0;
static volatile uint16_t wasValid = 0;

static volatile float referenceSpeedWheel1 = 0;
static volatile float referenceSpeedWheel2 = 0;
static volatile float referenceSpeedWheel3 = 0;

static volatile float spdErrorWheel1 = 0;
static volatile float spdErrorWheel1Before = 0;
static volatile float spdIntErrorWheel1 = 0;
//static int16_t forceWheel1 = 0;
static volatile int16_t forceWheel1BeforeSaturation = 0;
static volatile float spdDerivatedErrorWheel1 = 0;
//static int16_t absForceWheel1 = 0;

static volatile float spdErrorWheel2 = 0;
static volatile float spdErrorWheel2Before = 0;
static volatile float spdIntErrorWheel2 = 0;
static int16_t forceWheel2 = 0;
static volatile int16_t forceWheel2BeforeSaturation = 0;
static volatile float spdDerivatedErrorWheel2 = 0;
static int16_t absForceWheel2 = 0;
static float absForceWheel2Float = 0;
static float absForceWheel2_prev = 0;

static volatile float spdErrorWheel3 = 0;
static volatile float spdErrorWheel3Before = 0;
static volatile float spdIntErrorWheel3 = 0;
static int16_t forceWheel3 = 0;
static volatile int16_t forceWheel3BeforeSaturation = 0;
static volatile float spdDerivatedErrorWheel3 = 0;
static int16_t absForceWheel3 = 0;
static float absForceWheel3Float = 0;
static float absForceWheel3_prev = 0;

static volatile float antiWindup = 2;
static volatile float ctrlP = 5;
static volatile float ctrlI = 1;
static volatile float ctrlD = 1;
static volatile float speedCtrlRampThreshold = 30;
static volatile float speedCtrlRampUpRate = 30;
static volatile float speedCtrlRampDownRate = 30;
static volatile uint8_t activeDampingEna = 0;

static volatile float gyroX,gyroY,gyroZ = 0;
static volatile float compassX,compassY,compassZ = 0;
static volatile float compassX_Max,compassY_Max,compassZ_Max = 0;
static volatile float compassX_Min,compassY_Min,compassZ_Min = 0;
static volatile uint8_t initialCompassCalib = 1;

static volatile float compassX_Range,compassY_Range,compassZ_Range = 0;
static volatile float compassX_Norm,compassY_Norm,compassZ_Norm = 0;
static volatile float compassX_NormFiltered,compassY_NormFiltered,compassZ_NormFiltered = 0;
static volatile float compassX_NormFilteredTilted,compassY_NormFilteredTilted = 0.0f;
static volatile float roll,pitch,heading = 0;
static volatile float realRoll, realPitch = 0;
static volatile float temperature,temperatureGyro = 0;
static volatile float fNormAcc,fSinRoll,fCosRoll,fSinPitch,fCosPitch = 0.0f;
static volatile float accX,accY,accZ = 0;
static volatile float accXFiltered,accYFiltered,accZFiltered = 0;
static volatile float accXFilteredKalman,accYFilteredKalman,accZFilteredKalman = 0;
static volatile float accXFilteredLPF,accYFilteredLPF,accZFilteredLPF = 0;

static volatile uint16_t rawADC = 0;
static volatile float batteryVoltage = 0;
static volatile float cellVoltage = 0;
/* USER CODE END PV */

