dudasdavid/OmniWheelRobot17/STM32F3_mock/OmniWheelRobot/Src/main.c
}

/** Configure pins as 
        * Analog 
        * Input 
        * Output
        * EVENT_OUT
        * EXTI
     PA11   ------> USB_DM
     PA12   ------> USB_DP
*/
static void MX_GPIO_Init(void)
{

  GPIO_InitTypeDef GPIO_InitStruct;

  /* GPIO Ports Clock Enable */
  __HAL_RCC_GPIOE_CLK_ENABLE();
  __HAL_RCC_GPIOC_CLK_ENABLE();
  __HAL_RCC_GPIOF_CLK_ENABLE();
  __HAL_RCC_GPIOA_CLK_ENABLE();
  __HAL_RCC_GPIOD_CLK_ENABLE();
  __HAL_RCC_GPIOB_CLK_ENABLE();

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(GPIOE, CS_I2C_SPI_Pin|LD4_Pin|LD3_Pin|LD5_Pin 
                          |LD7_Pin|LD9_Pin|LD10_Pin|LD8_Pin 
                          |LD6_Pin, GPIO_PIN_RESET);

  /*Configure GPIO pins : DRDY_Pin MEMS_INT3_Pin MEMS_INT4_Pin MEMS_INT1_Pin 
                           MEMS_INT2_Pin */
  GPIO_InitStruct.Pin = DRDY_Pin|MEMS_INT3_Pin|MEMS_INT4_Pin|MEMS_INT1_Pin 
                          |MEMS_INT2_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_EVT_RISING;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(GPIOE, &GPIO_InitStruct);

  /*Configure GPIO pins : CS_I2C_SPI_Pin LD4_Pin LD3_Pin LD5_Pin 
                           LD7_Pin LD9_Pin LD10_Pin LD8_Pin 
                           LD6_Pin */
  GPIO_InitStruct.Pin = CS_I2C_SPI_Pin|LD4_Pin|LD3_Pin|LD5_Pin 
                          |LD7_Pin|LD9_Pin|LD10_Pin|LD8_Pin 
                          |LD6_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOE, &GPIO_InitStruct);

  /*Configure GPIO pin : B1_Pin */
  GPIO_InitStruct.Pin = B1_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(B1_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pins : DM_Pin DP_Pin */
  GPIO_InitStruct.Pin = DM_Pin|DP_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
  GPIO_InitStruct.Alternate = GPIO_AF14_USB;
  HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

}

/* USER CODE BEGIN 4 */
float filter2 (float avg, float input, float alpha) {
  avg = (alpha * input) + (1.0 - alpha) * avg;
  return avg;
}

float absFloat(float num){
  if (num >= 0) return num;
  else return num*-1;
}

void saturateInteger(int16_t* i, int16_t min, int16_t max) {
  int16_t val = *i;
  if (val < min) val = min;
  else if (val > max) val = max;
  *i = val;
}
void saturateFloat(float* i, float min, float max) {
  float val = *i;
  if (val < min) val = min;
  else if (val > max) val = max;
  *i = val;
}

void saturateVolatileFloat(volatile float* i, float min, float max) {
  float val = *i;
  if (val < min) val = min;
  else if (val > max) val = max;
  *i = val;
}
/* USER CODE END 4 */

/* StartDefaultTask function */
void StartDefaultTask(void const * argument)
{

  /* USER CODE BEGIN 5 */
  uint16_t taskCounter = 0;
  uint16_t heartBeatCounter = 0;
  
  float voltageFullRange = NORMALVOLTAGE - LOWVOLTAGE;
  float voltageInRange = 0;
  float voltageRatio = 0;
  /* Infinite loop */
  for(;;)
  {
    taskCounter++;
    wasValid++;
    
    HAL_UART_Receive_IT(&huart1,receiveBuffer,3);
    
    if ((receiveBuffer[2] == 0xFF) || (receiveBuffer[1] == 0xFF) || (receiveBuffer[0] == 0xFF)){
      if ((receiveBuffer[0] == 0xFF) && (receiveBuffer[1] <=100) && (receiveBuffer[2] <=180)){
        referenceSpeed = receiveBuffer[1] / 5.0 * 2;
        referenceAngle = receiveBuffer[2] * 2.0;
        referenceTurn = 0;
        wasValid = 0;
      }
      else if ((receiveBuffer[1] == 0xFF) && (receiveBuffer[2] <=100) && (receiveBuffer[0] <=180)){
        referenceSpeed = receiveBuffer[2] / 5.0;
        referenceAngle = receiveBuffer[0] * 2.0;
        referenceTurn = 0;
        wasValid = 0;
      }
      else if ((receiveBuffer[2] == 0xFF) && (receiveBuffer[0] <=100) && (receiveBuffer[1] <=180)){
        referenceSpeed = receiveBuffer[0] / 5.0;
        referenceAngle = receiveBuffer[1] * 2.0;
        referenceTurn = 0;
        wasValid = 0;
      }
      else {
        referenceSpeed = 0;
        referenceAngle = 0;
        referenceTurn = 0;
      }
    }
    else {
      referenceSpeed = 0;
      referenceAngle = 0;
      referenceTurn = 0;
    }
    
    if (wasValid > 50){
      referenceSpeed = 0;
      referenceAngle = 0;
      referenceTurn = 0;
    }
    
    CompassLED(heading);
    
    if (cellVoltage >= NORMALVOLTAGE) {
      TIM8->CCR2 = (int)(0*2400/100*INDICATORBRIGHTNESS); //led R
      TIM8->CCR4 = (int)(100*2400/100*INDICATORBRIGHTNESS); //led G
      TIM8->CCR3 = (int)(0*2400/100*INDICATORBRIGHTNESS); //led B
    }
    else if (cellVoltage < NORMALVOLTAGE && cellVoltage >= LOWVOLTAGE) {
      voltageInRange = cellVoltage - LOWVOLTAGE;
      voltageRatio = voltageInRange / voltageFullRange;
      
      TIM8->CCR2 = (int)(100*(1-voltageRatio)*2400/100*INDICATORBRIGHTNESS); //led R
      TIM8->CCR4 = (int)(100*voltageRatio*2400/100*INDICATORBRIGHTNESS); //led G
      TIM8->CCR3 = (int)(0*2400/100*INDICATORBRIGHTNESS); //led B
    }
    else if (cellVoltage < LOWVOLTAGE) {
      TIM8->CCR4 = (int)(0*2400/100*INDICATORBRIGHTNESS); //led G
      TIM8->CCR3 = (int)(0*2400/100*INDICATORBRIGHTNESS); //led B
      if (taskCounter % 4 == 0) {
        if (heartBeatCounter == 0) TIM8->CCR2 = (int)(100*2400/100*INDICATORBRIGHTNESS); //led R;
        else if (heartBeatCounter == 3) TIM8->CCR2 = (int)(0*2400/100*INDICATORBRIGHTNESS); //led R;
        else if (heartBeatCounter == 5) TIM8->CCR2 = (int)(100*2400/100*INDICATORBRIGHTNESS); //led R;
        else if (heartBeatCounter == 8) TIM8->CCR2 = (int)(0*2400/100*INDICATORBRIGHTNESS); //led R;
        else if (heartBeatCounter == 12) heartBeatCounter = -1;
        heartBeatCounter++;
      }
    }
    else {
      TIM8->CCR2 = (int)(100*2400/100*INDICATORBRIGHTNESS); //led R
      TIM8->CCR4 = (int)(100*2400/100*INDICATORBRIGHTNESS); //led G
      TIM8->CCR3 = (int)(100*2400/100*INDICATORBRIGHTNESS); //led B
    }
      
    osDelay(20);
  }
  /* USER CODE END 5 */ 
}

/* StartSensorTask function */
void StartSensorTask(void const * argument)
{
  /* USER CODE BEGIN StartSensorTask */
  uint16_t taskCounter = 0;
  float gyroBuffer[3];
  float compassBuffer[3];
  float accelerometerBuffer[3] = {0};
  //float temperatureBuffer[1] = {0};
  float temperatureBufferGyro[1] = {0};
  /* Infinite loop */
  for(;;)
  {
    taskCounter++;
    
    rawWheel3 = TIM1->CNT;   // jobb
    rawWheel2 = (TIM2->CNT); // bal
    rawWheel1 = (TIM3->CNT)*-1;
    
