dudasdavid/OmniWheelRobot17/STM32F3_mock/OmniWheelRobot/Src/main.c
    posWheel1_prev = posWheel1;
    posWheel2_prev = posWheel2;
    posWheel3_prev = posWheel3;
    
    spdWheel1_prev = spdWheel1;
    spdWheel2_prev = spdWheel2;
    spdWheel3_prev = spdWheel3;
    
    posWheel1 = rawWheel1*toMeterFactor;
    posWheel2 = rawWheel2*toMeterFactor;
    posWheel3 = rawWheel3*toMeterFactor;
    
    
    if (fabs(posWheel1-posWheel1_prev) > 100) spdWheel1 = spdWheel1_prev;
    else spdWheel1 = (posWheel1 - posWheel1_prev);
    if (fabs(posWheel2-posWheel2_prev) > 100) spdWheel2 = spdWheel2_prev;
    else spdWheel2 = (posWheel2 - posWheel2_prev);
    if (fabs(posWheel3-posWheel3_prev) > 100) spdWheel3 = spdWheel3_prev;
    else spdWheel3 = (posWheel3 - posWheel3_prev);
   
    
    spdWheel1Filtered = filter2(spdWheel1Filtered, spdWheel1, 0.35);
    spdWheel2Filtered = filter2(spdWheel2Filtered, spdWheel2, 0.35);
    spdWheel3Filtered = filter2(spdWheel3Filtered, spdWheel3, 0.35);
    
    //spdWheel1Norm = spdWheel1Filtered * 200;
    spdWheel2Norm = spdWheel2Filtered * 200;
    spdWheel3Norm = spdWheel3Filtered * 200;

    
    if (taskCounter % 4 == 0){
      /* Read Gyro Angular data */
      BSP_GYRO_GetXYZ(gyroBuffer);
      
      gyroX = gyroBuffer[0];
      gyroY = gyroBuffer[1];
      gyroZ = gyroBuffer[2];
      
      BSP_GYRO_GetTemp(temperatureBufferGyro);
      temperatureGyro = temperatureBufferGyro[0];
      
      /* Read Acceleration*/
      BSP_ACCELERO_GetXYZ(accelerometerBuffer);

      accX = accelerometerBuffer[0];
      accY = accelerometerBuffer[1];
      accZ = accelerometerBuffer[2];
      
      accXFiltered = filter2(accXFiltered, accX, 0.2);
      accYFiltered = filter2(accYFiltered, accY, 0.2);
      accZFiltered = filter2(accZFiltered, accZ, 0.2);
      
      accZFilteredKalman = kalman_single(accZ, 60, 10);
      accZFilteredLPF    = LPF(accZ,1,40);
      //roll  = atan2(accYFiltered, sqrt(accXFiltered*accXFiltered + accZFiltered*accZFiltered));
      //pitch = atan2(accXFiltered, sqrt(accYFiltered*accYFiltered + accZFiltered*accZFiltered));
      
      /* Read Magnetometer*/
      LSM303DLHC_MagReadXYZ(compassBuffer);
      compassX = compassBuffer[0];
      compassY = compassBuffer[1];
      compassZ = compassBuffer[2];
      
      if (initialCompassCalib == 1){
        compassX_Max = compassX;
        compassX_Min = compassX;
        compassY_Max = compassY;
        compassY_Min = compassY;
        compassZ_Max = compassZ;
        compassZ_Min = compassZ;
        initialCompassCalib = 0;
      }
      
      if (compassX > compassX_Max) compassX_Max = compassX;
      if (compassY > compassY_Max) compassY_Max = compassY;
      if (compassZ > compassZ_Max) compassZ_Max = compassZ;
      if (compassX < compassX_Min) compassX_Min = compassX;
      if (compassY < compassY_Min) compassY_Min = compassY;
      if (compassZ < compassZ_Min) compassZ_Min = compassZ;
      
      
      //The code you quoted first subtracts the minimum raw value from the reading,
      //then divides it by the range between the minimum and maximum raw values,
      //which puts the reading into the range of 0 to 1.
      //It then multiplies the reading by 2 and subtracts 1 to put it in the range of -1 to 1.
      
      saturateVolatileFloat(&compassX, COMPASS_X_MIN, COMPASS_X_MAX);
      saturateVolatileFloat(&compassY, COMPASS_Y_MIN, COMPASS_Y_MAX);
      saturateVolatileFloat(&compassZ, COMPASS_Z_MIN, COMPASS_Z_MAX);
      
      compassX_Norm = (compassX - COMPASS_X_MIN) / (COMPASS_X_MAX - COMPASS_X_MIN) * 2 - 1.0;
      compassY_Norm = (compassY - COMPASS_Y_MIN) / (COMPASS_Y_MAX - COMPASS_Y_MIN) * 2 - 1.0;
      compassZ_Norm = (compassZ - COMPASS_Z_MIN) / (COMPASS_Z_MAX - COMPASS_Z_MIN) * 2 - 1.0;
      
      compassX_NormFiltered = filter2(compassX_NormFiltered, compassX_Norm, 0.3);
      compassY_NormFiltered = filter2(compassY_NormFiltered, compassY_Norm, 0.3);
      compassZ_NormFiltered = filter2(compassZ_NormFiltered, compassZ_Norm, 0.3);
      
      
      fNormAcc = sqrt((accXFiltered*accXFiltered)+(accYFiltered*accYFiltered)+(accZFiltered*accZFiltered));
        
      fSinRoll = accYFiltered/fNormAcc;
      fCosRoll = sqrt(1.0-(fSinRoll * fSinRoll));
      fSinPitch = -accXFiltered/fNormAcc;
      fCosPitch = sqrt(1.0-(fSinPitch * fSinPitch));
        
      if ( fSinRoll >0) {
        if (fCosRoll>0) roll = acos(fCosRoll)*180/PI;
        else            roll = acos(fCosRoll)*180/PI + 180;
      }
      else {
        if (fCosRoll>0) roll = acos(fCosRoll)*180/PI + 360;
        else            roll = acos(fCosRoll)*180/PI + 180;
      }
       
      if ( fSinPitch >0) {
        if (fCosPitch>0) pitch = acos(fCosPitch)*180/PI;
        else             pitch = acos(fCosPitch)*180/PI + 180;
      }
      else {
        if (fCosPitch>0) pitch = acos(fCosPitch)*180/PI + 360;
        else             pitch = acos(fCosPitch)*180/PI + 180;
      }

      if (roll >=360)  roll = 360 - roll;
      if (pitch >=360) pitch = 360 - pitch;
      
      realRoll = pitch;
      realPitch = roll + 40;
      
      
      compassX_NormFilteredTilted = compassX_NormFiltered*fCosPitch+compassZ_NormFiltered*fSinPitch;
      compassY_NormFilteredTilted = compassX_NormFiltered*fSinRoll*fSinPitch+compassY_NormFiltered*fCosRoll-compassZ_NormFiltered*fSinRoll*fCosPitch;
      //xh=cx*cos(ayf)+cy*sin(ayf)*sin(axf)-cz*cos(axf)*sin(ayf);
      //yh=cy*cos(axf)+cz*sin(axf);
      
      //compassX_NormFilteredTilted = compassX_NormFiltered*fCosRoll + compassY_NormFiltered*fSinRoll*fSinPitch - compassZ_NormFiltered*fCosPitch*fSinRoll;
      //compassY_NormFilteredTilted = compassY_NormFiltered*fCosPitch + compassZ_NormFiltered*fSinPitch;
      
      heading = (float) ((atan2f((float)compassY_NormFilteredTilted,(float)compassX_NormFilteredTilted))*180)/PI;
      heading += 180;
      
      if (heading < 0) heading = heading + 360;
      
      rawADC = HAL_ADC_GetValue(&hadc1);
      batteryVoltage = rawADC/198.8;
      cellVoltage = batteryVoltage / BATTERYCELLS;
      //cellVoltage = 2.9;
    }
    
