dudasdavid/OmniWheelRobot17/STM32F3_mock/OmniWheelRobot/Src/main.c
    osDelay(5);
  }
  /* USER CODE END StartSensorTask */
}

/* StartControlTask function */
void StartControlTask(void const * argument)
{
  /* USER CODE BEGIN StartControlTask */
  /* Infinite loop */
  for(;;)
  {
    
    //referenceSpeedWheel1 = referenceSpeed * cosf(referenceAngle * PI / 180.0) + radius * referenceTurn;
    //referenceSpeedWheel2 = referenceSpeed * (-0.5 * cosf(referenceAngle * PI / 180.0) + 0.866 * sinf(referenceAngle * PI / 180.0)) + radius * referenceTurn;
    //referenceSpeedWheel3 = referenceSpeed * (-0.5 * cosf(referenceAngle * PI / 180.0) - 0.866 * sinf(referenceAngle * PI / 180.0)) + radius * referenceTurn;
    
    referenceSpeedWheel2 = 0;
    referenceSpeedWheel3 = 0;
    
    if (referenceSpeed > 0) {
      activeDampingEna = 1;
    }

    if ((referenceAngle >= 0) && (referenceAngle < 90)) //1st quadrant
    {
        referenceSpeedWheel2 = referenceSpeed;
        referenceSpeedWheel3 = -referenceSpeed * cosf(referenceAngle * PI / 180.0 * 2);
    }
    else if ((referenceAngle >= 90) && (referenceAngle < 180)) //2nd quadrant
    {
        referenceSpeedWheel2 = -referenceSpeed * cosf(referenceAngle * PI / 180.0 * 2);
        referenceSpeedWheel3 = referenceSpeed;
    }
    else if ((referenceAngle >= 180) && (referenceAngle < 270)) //3rd quadrant
    {
        referenceSpeedWheel2 = -referenceSpeed;
        referenceSpeedWheel3 = referenceSpeed * cosf(referenceAngle * PI / 180.0 * 2);
    }
    else if ((referenceAngle >= 270) && (referenceAngle <= 360)) //4th quadrant
    {
        referenceSpeedWheel2 = referenceSpeed * cosf(referenceAngle * PI / 180.0 * 2);
        referenceSpeedWheel3 = -referenceSpeed;
    }

    /*
    spdErrorWheel1Before = spdErrorWheel1;
    spdErrorWheel1 = referenceSpeedWheel1 - spdWheel1Norm;
    spdIntErrorWheel1 = spdIntErrorWheel1 + spdErrorWheel1 + antiWindup * (forceWheel1 - forceWheel1BeforeSaturation);
    spdDerivatedErrorWheel1 = spdErrorWheel1 - spdErrorWheel1Before;
      
    forceWheel1 = (int)(ctrlP * spdErrorWheel1 + ctrlI * spdIntErrorWheel1 + ctrlD * spdDerivatedErrorWheel1);
    forceWheel1BeforeSaturation = forceWheel1;
    */
    spdErrorWheel2Before = spdErrorWheel2;
    spdErrorWheel2 = referenceSpeedWheel2 - spdWheel2Norm;
    spdIntErrorWheel2 = spdIntErrorWheel2 + spdErrorWheel2 + antiWindup * (forceWheel2 - forceWheel2BeforeSaturation);
    spdDerivatedErrorWheel2 = spdErrorWheel2 - spdErrorWheel2Before;
      
    forceWheel2 = (int)(ctrlP * spdErrorWheel2 + ctrlI * spdIntErrorWheel2 + ctrlD * spdDerivatedErrorWheel2);
    forceWheel2BeforeSaturation = forceWheel2;
    
    spdErrorWheel3Before = spdErrorWheel3;
    spdErrorWheel3 = referenceSpeedWheel3 - spdWheel3Norm;
    spdIntErrorWheel3 = spdIntErrorWheel3 + spdErrorWheel3 + antiWindup * (forceWheel3 - forceWheel3BeforeSaturation);
    spdDerivatedErrorWheel3 = spdErrorWheel3 - spdErrorWheel3Before;
      
    forceWheel3 = (int)(ctrlP * spdErrorWheel3 + ctrlI * spdIntErrorWheel3 + ctrlD * spdDerivatedErrorWheel3);
    forceWheel3BeforeSaturation = forceWheel3;
    
    //if ((absFloat(referenceSpeed) < 0.05) && (absFloat(spdErrorWheel1) < 0.1)){
    //  spdIntErrorWheel1-=spdIntErrorWheel1*0.05;
    //}
    
    ////// PWM OUT //////
    //saturateInteger(&forceWheel1, -100, 100);
    //absForceWheel1 = ABS(forceWheel1);
    absForceWheel2_prev = absForceWheel2;
    absForceWheel3_prev = absForceWheel3;
    
    saturateInteger(&forceWheel2, -90, 90);
    absForceWheel2 = ABS(forceWheel2);
    saturateInteger(&forceWheel3, -90, 90);
    absForceWheel3 = ABS(forceWheel3);
    
    absForceWheel2Float = absForceWheel2;
    absForceWheel3Float = absForceWheel3;
    
    if (absForceWheel2Float - absForceWheel2_prev > speedCtrlRampThreshold){
      absForceWheel2Float = absForceWheel2_prev + speedCtrlRampUpRate;
    }
    else {
      absForceWheel2Float = absForceWheel2Float;
    }
    
    if (absForceWheel3Float - absForceWheel3_prev > speedCtrlRampThreshold){
      absForceWheel3Float = absForceWheel3_prev + speedCtrlRampUpRate;
    }
    else {
      absForceWheel3Float = absForceWheel3Float;
    }
    
    if (absForceWheel2_prev - absForceWheel2Float > speedCtrlRampThreshold){
      absForceWheel2Float = absForceWheel2_prev - speedCtrlRampDownRate;
    }
    else {
      absForceWheel2Float = absForceWheel2Float;
    }
    
    if (absForceWheel3_prev - absForceWheel3Float > speedCtrlRampThreshold){
      absForceWheel3Float = absForceWheel3_prev - speedCtrlRampDownRate;
    }
    else {
      absForceWheel3Float = absForceWheel3Float;
    }
    
    absForceWheel2 = (uint16_t)absForceWheel2Float;
    absForceWheel3 = (uint16_t)absForceWheel3Float;
    
    if ((referenceSpeed < 1) && (activeDampingEna == 1)){
      forceWheel2 = (int)(-0.8 * realPitch);
      forceWheel3 = (int)(-0.8 * realPitch);
      saturateInteger(&forceWheel2, -40, 40);
      absForceWheel2 = ABS(forceWheel2);
      saturateInteger(&forceWheel3, -40, 40);
      absForceWheel3 = ABS(forceWheel3);
    }
    
    /*
    absForceWheel1 = 0;
    absForceWheel2 = 0;
    absForceWheel3 = 0;
    */
    /*
    if (forceWheel1 <= 0) {
      TIM4->CCR1 = 0;
      TIM4->CCR2 = absForceWheel1*2400/100;
    }
    else {
      TIM4->CCR1 = absForceWheel1*2400/100;
      TIM4->CCR2 = 0;
    }
    */
    if (forceWheel2 <= 0) { // bal
      TIM4->CCR3 = 0;
      TIM4->CCR4 = absForceWheel2*2400/100;
    }
    else {
      TIM4->CCR3 = absForceWheel2*2400/100;
      TIM4->CCR4 = 0;
    }
    
    
    if (forceWheel3 <= 0) { // jobb
      TIM15->CCR1 = 0;
      TIM15->CCR2 = absForceWheel3*2400/100;
    }
    else {
      TIM15->CCR1 = absForceWheel3*2400/100;
      TIM15->CCR2 = 0;
    }
    
    /*
    TIM4->CCR1 = 0*2400/100;
    TIM4->CCR2 = 0*2400/100;
    TIM4->CCR3 = 10*2400/100; // bal
    TIM4->CCR4 = 0*2400/100;
    TIM15->CCR1 = 10*2400/100; // jobb
    TIM15->CCR2 = 0*2400/100;
    */
    osDelay(5);
  }
  /* USER CODE END StartControlTask */
}

/**
  * @brief  Period elapsed callback in non blocking mode
  * @note   This function is called  when TIM7 interrupt took place, inside
  * HAL_TIM_IRQHandler(). It makes a direct call to HAL_IncTick() to increment
  * a global variable "uwTick" used as application time base.
  * @param  htim : TIM handle
  * @retval None
  */
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
/* USER CODE BEGIN Callback 0 */

/* USER CODE END Callback 0 */
  if (htim->Instance == TIM7) {
    HAL_IncTick();
  }
/* USER CODE BEGIN Callback 1 */

/* USER CODE END Callback 1 */
}

/**
  * @brief  This function is executed in case of error occurrence.
  * @param  None
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler */
  /* User can add his own implementation to report the HAL error return state */
  while(1) 
  {
  }
  /* USER CODE END Error_Handler */ 
}

#ifdef USE_FULL_ASSERT

/**
   * @brief Reports the name of the source file and the source line number
   * where the assert_param error has occurred.
   * @param file: pointer to the source file name
   * @param line: assert_param error line source number
   * @retval None
   */
void assert_failed(uint8_t* file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
    ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */

}

#endif

/**
  * @}
  */ 

/**
  * @}
*/ 

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
